Enums/ТипТерминалаОргСхемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипТерминалаОргСхемы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учредитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РуководящийСостав</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Департамент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отдел</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Секция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сектор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сотрудник</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ОргСхема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ОргСхема</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦКП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обязанности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТерминала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипТерминалаОргСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шрифт</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоднятьВверх</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокВСхеме</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляОргсхемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСтатистик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_НастройкиРабочегоСтолаСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фотографии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЗаголовка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаЦКП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УведомлятьОЗаполненииСтатистик</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИА_УведомленияОЗаполненииСтатистик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоВложеннаяОргсхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаВложеннуюОргсхему</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДолжности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Статистики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Статистика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ВидыСтатистик</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_ОргСхема_Сервер/Ext/Module.bsl
Функция ПолучитьШрифтПодписиСотрудника() Экспорт
    шр = ИА_ОргСхема_СерверПовторИсп.Константа_ПолучитьШрифтПодписиСотрудника();
	Возврат шр;
КонецФункции

Функция ПоместитьВХранилище(Об) Экспорт
	
	хз = Новый ХранилищеЗначения(Об);
	Возврат хз;
	
КонецФункции	

Функция ПолучитьИзХранилища(ОбХранилище) Экспорт
	
	Возврат ОбХранилище.Получить();
	
КонецФункции

Функция ПолучитьПредставлениеСотрудников(пТерминал, КолСот=0, ФотоСотрудника = Неопределено, П = Неопределено, Сотрудник2Фото = Неопределено, КэшДанных = Неопределено) Экспорт
	
	Рез = "";
	
	ЭтоПервый = Истина;
	
	Сотрудник2Фото = Новый Соответствие;
	
	ФотоСотрудника = Неопределено;
    
    Если КэшДанных = Неопределено Тогда
    	КэшДанных = ИА_Защита_Оргсхема.КэшДанных_Сформировать();
	КонецЕсли; 
	
    пТерминалСотрудники = КэшДанных_РеквизитПоста(КэшДанных, пТерминал, "Сотрудники");
	КолСот = пТерминалСотрудники.Количество();
	
	//ВыводитьФото = пТерминал.Фотографии;// ИА_ 20160225
	//ВыводитьФото = КэшДанных_РеквизитПоста(КэшДанных, пТерминал, "Фотографии");//ИА_ 20160630
	Для каждого стр из пТерминалСотрудники Цикл
		Если не ЭтоПервый Тогда
			Рез = Рез + Символы.ПС;
        КонецЕсли;
        
        Если НЕ КэшДанных.Свойство("КэшДанныхФизЛиц") Тогда
        	КэшДанных.Вставить("КэшДанныхФизЛиц", Новый Соответствие);
        КонецЕсли; 
        Данные = КэшДанных.КэшДанныхФизЛиц[стр.ФизЛицо];
        Если Данные = Неопределено Тогда
            //иа_ ФИО = стр.ФизЛицо.Наименование; // Сейчас нет смысла кэшировать, т.к. для получения "фото" все равно идет обращение к справочнику
			ФИО = КэшДанных_РеквизитФизЛица(КэшДанных, стр.ФизЛицо, "Наименование");
			
            ФИО = ИА_ОргСхема_СерверПовторИсп.ПолучитьИнициалыПоСтроке(ФИО);
			//Если ВыводитьФото Тогда
            	Фото = ИА_КСУОбщийСервер.ПолучитьФотоФизЛица(стр.ФизЛицо);	
			//Иначе
			//	фото=Неопределено;
			//КонецЕсли;
            Данные = Новый Структура("ФИО, Фото", ФИО, Фото);
            КэшДанных.КэшДанныхФизЛиц.Вставить(стр.ФизЛицо, Данные);
        КонецЕсли; 
        ФИО = Данные.ФИО;
        
        Если ФотоСотрудника = Неопределено Тогда
            ФотоСотрудника = Данные.Фото;
            //Сотрудник2Фото.Вставить(ФИО, ФотоСотрудника);
		КонецЕсли;
		Сотрудник2Фото.Вставить(ФИО, Данные.Фото);
		
		
		Рез = Рез + ФИО;
		ЭтоПервый = Ложь;
	КонецЦикла;
	
	Возврат Рез;
	
КонецФункции

Функция ПолучитьМассивФИО(ФИО)

	МассивФИО = Новый Массив;
	МассивФИО.Добавить("");
	МассивФИО.Добавить("");
	МассивФИО.Добавить("");
	
	МассивПодсток = РазложитьСтрокуВМассивПодстрок1(ФИО, " ");
	Для Индекс = 0 По МассивПодсток.ВГраница() Цикл
		Если Индекс < 3 Тогда
			МассивФИО[Индекс] = МассивПодсток[Индекс];
		Иначе
			МассивФИО[2] = МассивФИО[2] + " " + МассивПодсток[Индекс];
		КонецЕсли;
	КонецЦикла;

	Возврат МассивФИО;
	
КонецФункции // ПолучитьМассивФИО()

Функция РазложитьСтрокуВМассивПодстрок1(Строка, Разделитель = ",", ПропускатьПустыеСтроки = Неопределено) Экспорт
    Возврат ИА_ОргСхема_СерверПовторИсп.РазложитьСтрокуВМассивПодстрок1(Строка, Разделитель, ПропускатьПустыеСтроки); 
КонецФункции

Функция Ссылка2Стрктура(Ссылка, Поля) Экспорт 
	Д = Новый Структура(Поля);
	
	ЗаполнитьЗначенияСвойств(Д, Ссылка.ПолучитьОбъект());
	
	Для Каждого эл из Д Цикл
		Если ТипЗнч(эл.Значение) = Тип("ХранилищеЗначения") Тогда
			Д[эл.Ключ] = эл.Значение.Получить();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Д;
КонецФункции
 
Функция КэшДанных_РеквизитПоста(Кэш, Пост, Имя) Экспорт
	ТЗ = Кэш.ОргСхема;
	
	НайдСтрока = ТЗ.Найти(Пост,"Ссылка");
	
	Если НайдСтрока <> Неопределено Тогда
		Результат = НайдСтрока[Имя];
	Иначе
		Результат = Пост[Имя];
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции

Функция КэшДанных_РеквизитФизЛица(Кэш, ФизЛицо, Имя) Экспорт
	ТЗ = Кэш.ФизЛица;
	
	НайдСтрока = ТЗ.Найти(ФизЛицо,"Ссылка");
	
	Если НайдСтрока <> Неопределено Тогда
		Результат = НайдСтрока[Имя];
	Иначе
		Результат = ФизЛицо[Имя];
	КонецЕсли; 
	
	Возврат Результат;
КонецФункции
	
Функция КэшДанных_ПостыПоРодителю(Кэш, ПостРодителя) Экспорт
    М = Кэш.ОргСхема.НайтиСтроки(Новый Структура("Родитель, ПометкаУдаления",ПостРодителя,Ложь));		
    
    Результат = Кэш.ОргСхема.СкопироватьКолонки();
    Для каждого СтрокаТЗ Из М Цикл
    	ЗаполнитьЗначенияСвойств(Результат.Добавить(), СтрокаТЗ);
    КонецЦикла; 
    
    Результат.Сортировать("ПорядокВСхеме");
    Возврат Результат;
КонецФункции

Функция ПолучитьМинимальнуюВысотуБлока(Тест, Ширина, Шрифт) Экспорт
	Шрифт1 = ЗначениеИзСтрокиВнутр(Шрифт);
	
	Таб = Новый ТабличныйДокумент;
	об = Таб.Область("R1C1:R1C1");
	об.ШиринаКолонки = Ширина/1.852;
	об.Шрифт = Новый Шрифт(Шрифт1);
	об.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
	об.Текст = Тест;
    Надпись = Таб.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
    Надпись.Расположить(об); 
    Возврат Надпись.Высота;
КонецФункции	   

Процедура НарисоватьДерево(ос, строкаДерева, знач сдвигЛево, знач сдвигВерх, ПараметрыОргсхемы, МассивНарисованныхЭлементов, КэшДанных) Экспорт
	
	ШрифтПодписиСотрудника = ИА_ОргСхема_Сервер.ПолучитьШрифтПодписиСотрудника();
	ЭМ = ПараметрыОргсхемы.ЭМ;
	ЭтоДепартамент = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент;
	ЭтоРукСостав = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав;
	ЭтоУчредитель = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Учредитель;
	ЭтоОтдел = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел;
	ЭтоСекция = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция;
	ЭтоСектор = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор;
	ЭтоСотрудник = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник;
	ЭтоОрганизация = Перечисления.ТипТерминалаОргСхемы.Организация;
	СсылкаНаОрг = Справочники.ОргСхема.НайтиПоНаименованию(строкаДерева.Ссылка.Наименование);
	
	Если строкаДерева.ТипТерминала <> Перечисления.ТипТерминалаОргСхемы.Организация Тогда // По вложенной не рисуем		
		центрБлока = сдвигЛево + строкаДерева.ШиринаПодчиненных/2;	
		
		//ос.ВерхнийКолонтитул.ТекстВЦентре = 
		
		ТекстСекции = "";
		// отрисовка блока
		новБлок = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
		новБлок.Лево = ?(ЭтоУчредитель, сдвигЛево, центрБлока - строкаДерева.Ширина/2);
		
		
		Если ЭтоДепартамент Тогда
			верх =  ПараметрыОргсхемы.УровеньДепартаментов;
		Иначе
			верх = сдвигВерх;
		КонецЕсли;
		верх = верх - ?(ЭтоДепартамент И строкаДерева.ПоднятьВверх, ПараметрыОргсхемы.ПоднятиеСекции, 0);    
		
		// опускаем чайлдов департамента (оформление "Отдельно")   
		Если ПараметрыОргсхемы.ОформлениеОтдельно	И (ЭтоОтдел Или ЭтоСекция или ЭтоСектор Или ЭтоСотрудник) Тогда
			верх = верх + ПараметрыОргсхемы.расстояниеМеждуБлокамиВерт;
		КонецЕсли;
					
		новБлок.Верх = верх;
		новБлок.Ширина = строкаДерева.Ширина;
		
		// сужаем ширину департамента и смещаем его положение на центр (оформление "Отдельно") 
		Если ПараметрыОргсхемы.ОформлениеОтдельно И ЭтоДепартамент и не ЭМ Тогда
			новБлок.Ширина = строкаДерева.Ширина * 0.7; // 0.7 это 70% от реальной ширины при отображении отдельно
			новБлок.Лево = новБлок.Лево + строкаДерева.Ширина * 0.15; 
		КонецЕсли;
		
		новБлок.Высота = строкаДерева.Высота;
		новБлок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		
		новБлок.Текст = строкаДерева.НаименованиеДляОргсхемы;
		Если ЭтоСекция или ЭтоСектор Тогда
			ТекстСекции = новБлок.Текст;
			Если ЭМ Тогда
				новБлок.Текст = "";
			Иначе
				новБлок.Текст = "ЦКП:" +Символы.ПС+ строкаДерева.ЦКП;
				новБлок.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
			КонецЕсли;
		КонецЕсли;
		
		Если ЭтоСотрудник И (строкаДерева.ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.Секция ИЛИ строкаДерева.ТипТерминалаРодителя = Перечисления.ТипТерминалаОргСхемы.Сектор) Тогда
			новБлок.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
			новБлок.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Точечная); 
			новБлок.ГраницаСверху = истина;
			новБлок.ГраницаСлева = Ложь;
			новБлок.ГраницаСправа = Ложь;
			новБлок.ГраницаСнизу = Ложь;
			новБлок.ЦветЛинии = Новый Цвет(120,120,120);
			новБлок.Лево = новБлок.Лево + 1;
			новБлок.Ширина = новБлок.Ширина - 2;
		КонецЕсли;
		
		новБлок.ГоризонтальноеПоложение = ?(ЭтоСекция или ЭтоСектор, ГоризонтальноеПоложение.Лево, ГоризонтальноеПоложение.Центр);
		новБлок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		
		ПараметрыОргсхемы.НижняяТочка = Макс(ПараметрыОргсхемы.НижняяТочка, новБлок.Верх + новБлок.Высота);
		
		шр = строкаДерева.Шрифт;
		Если шр<>Неопределено Тогда 
			новБлок.Шрифт = шр;
		Иначе
			новБлок.Шрифт = Новый Шрифт(новБлок.Шрифт, , , Истина);
		КонецЕсли;
		новБлок.Расшифровка = строкаДерева.Ссылка; // погарцев
		
		// толщина линии:
		Если ЭтоУчредитель Тогда
			новБлок.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная,3);
		ИначеЕсли ЭтоРукСостав Тогда
			новБлок.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная,2);
		КонецЕсли;
		
		// цвет блока
		цв = строкаДерева.ЦветФона;
		Если цв<>Неопределено Тогда
			новБлок.ЦветФона = цв;
		Иначе
			цв = Новый Цвет(255,255,255);
		КонецЕсли;

		// сохранение элементов для последующего анализа
		структураЭлемента = Новый Структура("Ссылка, ТипТерминала,Элемент, Лево, Верх, Ширина, Высота, ЦветФона, Шрифт, ЦКП, ВысотаПодчиненных, КоличествоПодчиненных");
		ЗаполнитьЗначенияСвойств(структураЭлемента, новБлок);
		структураЭлемента.ЦКП = строкаДерева.ЦКП;
		структураЭлемента.Элемент = ос.Рисунки.Индекс(новБлок); 
		структураЭлемента.Ссылка = строкаДерева.Ссылка;
		структураЭлемента.ТипТерминала = строкаДерева.ТипТерминала;
		структураЭлемента.ВысотаПодчиненных = строкаДерева.ВысотаПодчиненных;
		структураЭлемента.КоличествоПодчиненных = строкаДерева.Строки.Количество();
		
		МассивНарисованныхЭлементов.Добавить(структураЭлемента);
		строкаДерева.структураЭлемента = структураЭлемента;
		//
		
		Если ЭМ и (ЭтоСотрудник ИЛИ ЭтоСекция или ЭтоСекция) Тогда
			новБлок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			новБлок.ГраницаСверху = Ложь;		
			новБлок.ГраницаСнизу = Ложь;
		КонецЕсли;
			
		Если ЭтоСекция или ЭтоСектор Тогда // Выведем отдельно заголовок
			новБлокСекция = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
			новБлокСекция.Лево = новБлок.Лево+1;
			новБлокСекция.Верх = новБлок.Верх+1;
			новБлокСекция.Ширина = новБлок.Ширина-2;
			новБлокСекция.Высота = строкаДерева.ВысотаЗаголовка;
			новБлокСекция.ВертикальноеПоложение = ВертикальноеПоложение.Верх;
			новБлокСекция.Текст = ТекстСекции; // это заголовок
			новБлокСекция.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			Если ЭМ Тогда
				новБлокСекция.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			КонецЕсли;
			новБлокСекция.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			
			

			шр = строкаДерева.Шрифт;
			Если строкаДерева.Шрифт<>Неопределено Тогда 
				Если эм Тогда
					новБлокСекция.Шрифт = Новый Шрифт(шр, , , Истина , Ложь, Ложь);
				Иначе
					новБлокСекция.Шрифт = Новый Шрифт(шр, , , ложь , Истина, Истина);
				КонецЕсли;
			Иначе
				Если эм Тогда
					новБлокСекция.Шрифт = Новый Шрифт(, , Истина, Ложь, Ложь);
				Иначе
					новБлокСекция.Шрифт = Новый Шрифт(, , ложь , Истина, Истина);
				КонецЕСли
			КонецЕсли;
					
			новБлокСекция.Расшифровка = строкаДерева.Ссылка;
			новБлокСекция.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Точечная);
			новБлокСекция.ГраницаСверху = ложь;
			новБлокСекция.ГраницаСлева = ложь;
			новБлокСекция.ГраницаСправа = ложь;
			новБлокСекция.ГраницаСнизу = истина;
			новБлокСекция.ЦветФона = цв;
		КонецЕсли;
		
		//Подпись руководителей
		КолСотр = 0; 
		ФотоСотрудника = Неопределено;
		Сотрудник2Фото = Новый Соответствие;
		ТекстРук = ИА_ОргСхема_Сервер.ПолучитьПредставлениеСотрудников(строкаДерева.Ссылка, КолСотр, ФотоСотрудника, ПараметрыОргсхемы, Сотрудник2Фото, КэшДанных);
		
		БлокФото = Неопределено;
		БазовыйБлок = Неопределено; // то, что под фотографией
		
		ЭМ_ВысотаНО = ПараметрыОргсхемы.ВысотаНО;
		
		// вывод сотрудников
		СдвинутьВниз = ЭМ и ЭтоОтдел;
		ВывестиАдминаСекции = ЭМ и ЭтоСекция;
		
		Если СдвинутьВниз И КолСотр = 0 Тогда
			БазовыйБлокНО = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
			ЗаполнитьЗначенияСвойств(БазовыйБлокНО, новБлок,,"ПараметрРасшифровки");
			БазовыйБлокНО.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная);
			БазовыйБлокНО.Верх = новБлок.Верх + новБлок.Высота +ПараметрыОргсхемы.расстояниеПодОтделом;
			БазовыйБлокНО.Высота = ЭМ_ВысотаНО; 
			БазовыйБлокНО.ЦветФона = цв;
			БазовыйБлокНО.узор = ТипУзораТабличногоДокумента.Сплошной;
			БазовыйБлокНО.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			Если строкаДерева.Ссылка.НаименованиеДолжности <> "" тогда
				БазовыйБлокНО.Текст = строкаДерева.Ссылка.НаименованиеДолжности;
			Иначе				
				БазовыйБлокНО.Текст = "НАЧАЛЬНИК ОТДЕЛА";
			КонецЕсли;
			БазовыйБлокНО.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		КонецЕсли;
		
		Если ВывестиАдминаСекции Тогда
			БазовыйБлокАС = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
			ЗаполнитьЗначенияСвойств(БазовыйБлокАС, новБлокСекция,,"ПараметрРасшифровки");
			БазовыйБлокАС.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
			БазовыйБлокАС.Верх = новБлокСекция.Верх + новБлокСекция.Высота +1;
			Если строкаДерева.Ссылка.НаименованиеДолжности <> "" тогда
				БазовыйБлокАС.Высота = ПараметрыОргсхемы.ВысотаАдминСекции * Окр((СтрДлина((строкаДерева.Ссылка.НаименованиеДолжности)+10)/18),0,1);
				БазовыйБлокАС.Текст = строкаДерева.Ссылка.НаименованиеДолжности;
			Иначе
				БазовыйБлокАС.Высота = ПараметрыОргсхемы.ВысотаАдминСекции;
				БазовыйБлокАС.Текст = "Администратор секции";
			КонецЕсли; 
			БазовыйБлокАС.ЦветФона = цв;
			БазовыйБлокАС.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			БазовыйБлокАС.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
			БазовыйБлокАС.Шрифт = Новый Шрифт(БазовыйБлокАС.Шрифт,,,ложь,ложь,ложь);
			
			строкаДерева.ВысотаЗаголовка = строкаДерева.ВысотаЗаголовка +ПараметрыОргсхемы.ВысотаАдминСекции + 2; 
		КонецЕсли;
		
		Если КолСотр > 0 Тогда
			Если строкаДерева.Фотографии Тогда		
				Если ЭтоСекция или ЭтоСектор Тогда
					// новБлок - это весь блок
					// новБлокСекция - тут описание секции
					// добавляем блоки ниже новБлокСекция, как новБлокСекция размером
					ВысотаБлока = ПараметрыОргсхемы.ВысотаСотрудника;
					Для Н = 0 По СтрЧислоСтрок(ТекстРук)-1 Цикл		
						ФИО = СтрПолучитьСтроку(ТекстРук, Н+1);
						
						Смещение = Н * ВысотаБлока;
						
						БлокЗагаловок = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);	
						ЗаполнитьЗначенияСвойств(БлокЗагаловок, новБлок,,"ПараметрРасшифровки");
						новБлок.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);

						
						БлокФото = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
						ЗаполнитьЗначенияСвойств(БлокФото, новБлокСекция,,"ПараметрРасшифровки");
						БлокФото.Высота = ПараметрыОргсхемы.ВысотаСотрудника;
						БлокФото.Ширина = БлокФото.Высота/4*3;
						Попытка
							БлокФото.Картинка = ?(Сотрудник2Фото[ФИО]=Неопределено, Новый Картинка, Сотрудник2Фото[ФИО]);
						исключение
							БлокФото.Картинка = ?(Сотрудник2Фото[ФИО]=Неопределено, Новый Картинка, Новый Картинка(Сотрудник2Фото[ФИО]));
						КонецПопытки;
						БлокФото.Верх = новБлокСекция.Верх + строкаДерева.ВысотаЗаголовка + Смещение + 1;
						БлокФото.РазмерКартинки = РазмерКартинки.Пропорционально;
						
						БлокСотрудник = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
						ЗаполнитьЗначенияСвойств(БлокСотрудник, новБлокСекция,,"ПараметрРасшифровки");
						БлокСотрудник.Высота = ПараметрыОргсхемы.ВысотаСотрудника;
						БлокСотрудник.Верх = БлокФото.Верх;
						БлокСотрудник.Ширина = БлокСотрудник.Ширина - БлокФото.Ширина;
						БлокСотрудник.Лево = БлокСотрудник.Лево + БлокФото.Ширина;
						БлокСотрудник.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
						БлокСотрудник.Текст = ФИО;					
						БлокСотрудник.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
						Если ЭМ тогда
							БлокСотрудник.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
							БлокСотрудник.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии); 
							БлокФото.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии); 
						КонецЕсли;
						БлокСотрудник.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
						
						БлокСотрудник.ЦветФона = цв;
						БлокСотрудник.Шрифт = Новый Шрифт(ШрифтПодписиСотрудника);
					КонецЦикла;
					
				ИначеЕсли ЭтоСотрудник Тогда				
					КолСотр = СтрЧислоСтрок(ТекстРук);
					Если КолСотр > 0 Тогда
						ВысотаБлока = ПараметрыОргсхемы.ВысотаСотрудника;
						Если эм Тогда	
							новБлок.Лево = новБлок.Лево + ПараметрыОргсхемы.ОтступЛевоСотр;
							новБлок.Ширина = новБлок.Ширина - ПараметрыОргсхемы.ОтступЛевоСотр;
						КонецЕсли;

							
						Для Н = 0 По КолСотр-1 Цикл
							ФИО = СтрПолучитьСтроку(ТекстРук, Н+1);
							
							Смещение = Н * ВысотаБлока;
							
							БлокФото = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
							ЗаполнитьЗначенияСвойств(БлокФото, новБлок,,"ПараметрРасшифровки");
							БлокФото.Высота = ВысотаБлока;
							БлокФото.Ширина = БлокФото.Высота/4*3;
							Попытка
								БлокФото.Картинка = ?(Сотрудник2Фото[ФИО]=Неопределено, Новый Картинка, Сотрудник2Фото[ФИО]);
							Исключение
								БлокФото.Картинка = ?(Сотрудник2Фото[ФИО]=Неопределено, Новый Картинка, Новый Картинка(Сотрудник2Фото[ФИО]));
							КонецПопытки;
							БлокФото.Верх = БлокФото.Верх + строкаДерева.ВысотаЗаголовка + Смещение;
							БлокФото.РазмерКартинки = РазмерКартинки.Пропорционально;
							БлокФото.узор = ТипУзораТабличногоДокумента.Сплошной;
							БлокФото.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
							
							БлокСотрудник = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
							ЗаполнитьЗначенияСвойств(БлокСотрудник, новБлок,,"ПараметрРасшифровки");
							БлокСотрудник.Верх = БлокФото.Верх;
							БлокСотрудник.Высота = ВысотаБлока;
							БлокСотрудник.Ширина = БлокСотрудник.Ширина - БлокФото.Ширина;
							БлокСотрудник.Лево = БлокСотрудник.Лево + БлокФото.Ширина;
							БлокСотрудник.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
							БлокСотрудник.Текст = ФИО;
							БлокСотрудник.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
							Если ЭМ тогда
								БлокСотрудник.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;
							КонецЕсли;
							БлокСотрудник.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
							
							БлокСотрудник.ЦветФона = цв;
							БлокСотрудник.Шрифт = Новый Шрифт(ШрифтПодписиСотрудника);
							БлокСотрудник.узор = ТипУзораТабличногоДокумента.Сплошной;
							БлокСотрудник.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
							
							Если эм Тогда							
								БлокСотрудник.Ширина = БлокСотрудник.Ширина - ПараметрыОргсхемы.ОтступЛевоСотр;													
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				Иначе
					
					БазовыйБлок = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);				
					ЗаполнитьЗначенияСвойств(БазовыйБлок, новБлок,,"ПараметрРасшифровки");
					новБлок.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
					
					// вывод фото сбоку всего блока
					БлокФото = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
					ЗаполнитьЗначенияСвойств(БлокФото, новБлок,,"ПараметрРасшифровки");
					
					Если ЭтоОтдел Тогда 
						БлокФото.Ширина = БазовыйБлок.Ширина * 0.33; // фиксируем ширину фотографии для отдела					
						БлокФото.ЦветФона = цв;
					Иначе
						БлокФото.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
						БлокФото.Ширина = БлокФото.Высота/4*3;
					КонецЕсли;
					БлокФото.Узор = ТипУзораТабличногоДокумента.Сплошной;
					
					Если СдвинутьВниз Тогда
						БлокФото.Верх = новБлок.Верх + новБлок.Высота +ПараметрыОргсхемы.расстояниеПодОтделом;
						БлокФото.Высота = ЭМ_ВысотаНО; 
						БлокФото.Ширина = БлокФото.Высота/4*3;					
					Если строкаДерева.Ссылка.НаименованиеДолжности <> "" тогда
						ТекстРук = строкаДерева.Ссылка.НаименованиеДолжности + Символы.ПС + ТекстРук;
					Иначе				
						ТекстРук = "НАЧАЛЬНИК ОТДЕЛА"+ Символы.ПС + ТекстРук;
					КонецЕсли;							
					Иначе
						новБлок.Ширина = новБлок.Ширина - БлокФото.Ширина;
						новБлок.Лево = новБлок.Лево + БлокФото.Ширина;
					КонецЕсли;

					
					Попытка
						БлокФото.Картинка = ?(ФотоСотрудника=Неопределено, Новый Картинка, ФотоСотрудника);
					Исключение
						БлокФото.Картинка = ?(ФотоСотрудника=Неопределено, Новый Картинка, Новый Картинка(ФотоСотрудника));
					КонецПопытки;
					//БлокФото.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 1);
					БлокФото.РазмерКартинки = РазмерКартинки.Пропорционально;				
					
					
					// вывод сотрудников
					ВысотаБлока = ИА_ОргСхема_Сервер.ПолучитьМинимальнуюВысотуБлока(ТекстРук, новБлок.Ширина-2, ЗначениеВСтрокуВнутр(ШрифтПодписиСотрудника));
					новБлокРук = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
					
					
					
					Если СдвинутьВниз Тогда
						новБлокРук.Лево = новБлок.Лево+БлокФото.Ширина;
						новБлокРук.Ширина = (новБлок.Ширина-БлокФото.Ширина);
						новБлокРук.Верх = БлокФото.Верх;
						новБлокРук.Высота = БлокФото.Высота;
						
						//					
						БазовыйБлокНО = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
						ЗаполнитьЗначенияСвойств(БазовыйБлокНО, новБлок,,"ПараметрРасшифровки");
						БазовыйБлокНО.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная);
						БазовыйБлокНО.Верх = БлокФото.Верх;
						БазовыйБлокНО.Высота = БлокФото.Высота;
					Иначе
						новБлокРук.Лево = новБлок.Лево;
						новБлокРук.Ширина = новБлок.Ширина-2;
						новБлокРук.Верх = новБлок.Верх + новБлок.Высота - ВысотаБлока - 1; 
						новБлокРук.Высота = ВысотаБлока;
					КонецЕсли;
					
					новБлокРук.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
					новБлокРук.Текст = ТекстРук;
					новБлокРук.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
					новБлокРук.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
					новБлокРук.Расшифровка = строкаДерева.Ссылка;
					новБлокРук.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
					новБлокРук.ЦветФона = цв;
					Если не ЭМ Тогда
						новБлокРук.Шрифт = Новый Шрифт(ШрифтПодписиСотрудника);
					КонецЕсли;
				КонецЕсли;		
			Иначе // без фото
				Если ЭтоСекция или ЭтоСектор или ЭтоСотрудник Тогда
					КолСотр = СтрЧислоСтрок(ТекстРук);
					ВысотаБлока = ПараметрыОргсхемы.ВысотаСотрудника;
					
					Если ЭтоСотрудник и ЭМ Тогда
						новБлок.Лево = новБлок.Лево + ПараметрыОргсхемы.ОтступЛевоСотр;
						новБлок.Ширина = новБлок.Ширина - ПараметрыОргсхемы.ОтступЛевоСотр;
					КонецЕсли;
					
					Для Н = 0 По КолСотр-1 Цикл
						ФИО = СтрПолучитьСтроку(ТекстРук, Н+1);
						
						Смещение = Н * ВысотаБлока;
						
						БлокСотрудник = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
						БлокСотрудник.Верх = новБлок.Верх + строкаДерева.ВысотаЗаголовка + Смещение + ?(ЭтоСекция,1,0) + ?(ЭтоСектор,2,0);
						БлокСотрудник.Высота = ВысотаБлока;
						БлокСотрудник.Ширина = новБлок.Ширина-2;
						БлокСотрудник.Лево = новБлок.Лево+1;
						БлокСотрудник.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
						БлокСотрудник.Текст = ФИО;
						БлокСотрудник.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
						Если ЭМ тогда
							БлокСотрудник.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Лево;					
							Если не (ЭтоСекция или ЭтоСектор) Тогда
								БлокСотрудник.Лево = новБлок.Лево
							КонецЕсли;
						КонецЕсли;
						БлокСотрудник.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
						БлокСотрудник.Расшифровка = строкаДерева.Ссылка;
						
						БлокСотрудник.ЦветФона = цв;
						БлокСотрудник.Шрифт = Новый Шрифт(ШрифтПодписиСотрудника);
						БлокСотрудник.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);				
					КонецЦикла;

				Иначе
					Если СдвинутьВниз тогда
						БазовыйБлокНО = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
						ЗаполнитьЗначенияСвойств(БазовыйБлокНО, новБлок,,"ПараметрРасшифровки");
						БазовыйБлокНО.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная);
						БазовыйБлокНО.Верх = новБлок.Верх + новБлок.Высота +ПараметрыОргсхемы.расстояниеПодОтделом;
						БазовыйБлокНО.Высота = ЭМ_ВысотаНО; 
						БазовыйБлокНО.ЦветФона = цв;
						БазовыйБлокНО.узор = ТипУзораТабличногоДокумента.Сплошной;
						БазовыйБлокНО.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
						Если строкаДерева.Ссылка.НаименованиеДолжности <> "" тогда
							ТекстРук = строкаДерева.Ссылка.НаименованиеДолжности + Символы.ПС + ТекстРук;
						Иначе				
							ТекстРук = "НАЧАЛЬНИК ОТДЕЛА"+ Символы.ПС + ТекстРук;
						КонецЕсли;					
						БазовыйБлокНО.Текст = ТекстРук;
						БазовыйБлокНО.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
						БазовыйБлокНО.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
						БазовыйБлокНО.Расшифровка = строкаДерева.Ссылка;
					Иначе
						ВысотаБлока = ИА_ОргСхема_Сервер.ПолучитьМинимальнуюВысотуБлока(ТекстРук, новБлок.Ширина-2, ЗначениеВСтрокуВнутр(ШрифтПодписиСотрудника));
						новБлокРук = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
						новБлокРук.Лево = новБлок.Лево+1;
						новБлокРук.Верх = новБлок.Верх + новБлок.Высота - ВысотаБлока - 1; 
						новБлокРук.Ширина = новБлок.Ширина-2;
						новБлокРук.Высота = ВысотаБлока;
						новБлокРук.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
						новБлокРук.Текст = ТекстРук;
						новБлокРук.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
						новБлокРук.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
						
						новБлокРук.Расшифровка = строкаДерева.Ссылка;
						новБлокРук.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии);
						новБлокРук.ЦветФона = цв;
						новБлокРук.Шрифт = Новый Шрифт(ШрифтПодписиСотрудника);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// найдем максимальную высоту текущего уровня. для дальнейшей отрисовки подчиненных элементов
	Если ЭтоРукСостав ТОгда
		максВысота = ПараметрыОргсхемы.МаксВысотаРукСостав;
	ИначеЕсли ЭтоДепартамент ТОгда
		максВысота = ПараметрыОргсхемы.МаксВысотаДепартаменты;
	ИначеЕсли ЭтоОтдел ТОгда
		максВысота = ПараметрыОргсхемы.МаксВысотаОтделы;
	Иначе
		максВысота = строкаДерева.Высота;
	КонецЕсли;
	
	// линии:
	КолЧайлдов = строкаДерева.Строки.Количество();
		
	// рисование подчиненных. Вычисление их сдвига по вертикали
	Если ЭтоОтдел Тогда 
		св = сдвигВерх + максВысота + ПараметрыОргсхемы.расстояниеМеждуСекциями;	
		Если ЭМ Тогда
			св = св + ПараметрыОргсхемы.расстояниеПодОтделом + ЭМ_ВысотаНО; // доп сотрудник
		КонецЕсли;
	ИначеЕсли ЭтоДепартамент Тогда 
		св = ПараметрыОргсхемы.УровеньДепартаментов + строкаДерева.Высота - ?(строкаДерева.ПоднятьВверх, ПараметрыОргсхемы.ПоднятиеСекции,0);
	ИначеЕсли ЭтоСекция Тогда
		св = сдвигВерх + строкаДерева.ВысотаЗаголовка + ПараметрыОргсхемы.ВысотаСотрудника * КолСотр + 3;
		//св = сдвигВерх + строкаДерева.Высота + 3;
		//св = сдвигВерх + строкаДерева.ВысотаЗаголовка + 2;
	ИначеЕсли ЭтоСектор Тогда
		св = сдвигВерх + строкаДерева.ВысотаЗаголовка + ПараметрыОргсхемы.ВысотаСотрудника * КолСотр + 3;
	ИначеЕсли ЭтоСотрудник Тогда
		св = сдвигВерх + строкаДерева.Высота;
	ИначеЕсли ЭтоРукСостав Тогда
		св = сдвигВерх + максВысота + ПараметрыОргсхемы.расстояниеМеждуБлокамиВерт;
	Иначе
		св = сдвигВерх + максВысота + ПараметрыОргсхемы.расстояниеМеждуБлокамиВерт;
	КонецЕсли;
	
	сч = 0;
	св1 = св;
	сдвигЛево1 = сдвигЛево;
	Для каждого стр из строкаДерева.Строки Цикл
		стрЭтоДепартамент = стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Департамент");
		стрЭтоРукСостав = стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.РуководящийСостав");
		стрЭтоУчредитель = стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Учредитель");
		стрЭтоОтдел = стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел");
		стрЭтоСекция = стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Секция");
		стрЭтоСектор = стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сектор");
		стрЭтоСотрудник = стр.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Сотрудник");
		
		НарисоватьДерево(ос, стр, сдвигЛево1, св1, ПараметрыОргсхемы, МассивНарисованныхЭлементов, КэшДанных);	
		
		Если НЕ (стрЭтоСотрудник ИЛИ стрЭтоСекция или стрЭтоСектор) Тогда
			сдвигЛево1 = сдвигЛево1 + стр.ШиринаПодчиненных;
		КонецЕсли;
		
		Если стрЭтоДепартамент или стрЭтоРукСостав Тогда
			сдвигЛево1 = сдвигЛево1 + ПараметрыОргсхемы.расстояниеМеждуБлоками;
		КонецЕсли;
		
		//эм
		Если стрЭтоОтдел и ЭМ Тогда
			сдвигЛево1 = сдвигЛево1 + ПараметрыОргсхемы.расстояниеМеждуОтделами;
		КонецЕсли;
		
		
		Если стрЭтоСотрудник Тогда
			св1 = св1 + стр.Высота;
		ИначеЕсли стрЭтоСекция или стрЭтоСектор Тогда
			св1 = св1 + стр.Высота + ПараметрыОргсхемы.расстояниеМеждуСекциями;
		КонецЕсли;
				
		сч = сч + 1;
	КонецЦикла;
		
	Если ЭтоУчредитель И строкаДерева.Ссылка.Родитель.Фотографии Тогда
		Организация = строкаДерева.Ссылка.Родитель;
				
		БлокФото = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
		БлокФото.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 0);

		БлокФото.Высота = 30;
		БлокФото.Ширина = 30;
		Попытка
			Картинка = Новый Картинка(Организация.Логотип.Получить());
			БлокФото.Картинка = Картинка;
		исключение
			Сообщить("Не удалось получить логотип организации!");
		КонецПопытки;
		БлокФото.Верх = сдвигВерх;
		БлокФото.Лево = строкаДерева.ШиринаПодчиненных - БлокФото.Ширина;
		БлокФото.РазмерКартинки = РазмерКартинки.Пропорционально;
		
		БлокЗаголовок = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
		БлокЗаголовок.Линия = новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 0);

		им1 = ос.ВерхнийКолонтитул.Шрифт.Имя;
		НШрифт = новый Шрифт(им1,"14",истина,ложь,ложь,ложь,100);
		ос.ВерхнийКолонтитул.Шрифт = НШрифт;

		// отображение заголовка на ОРГСХЕМЕ
		//БлокЗаголовок.Высота = 20;
		//БлокЗаголовок.Ширина = 150;
		//БлокЗаголовок.Текст = "ОРГАНИЗУЮЩАЯ СХЕМА КОМПАНИИ " + строкаДерева.Ссылка.Родитель;
		//БлокЗаголовок.Шрифт = НШрифт;
		//БлокЗаголовок.Верх = сдвигВерх;
		//БлокЗаголовок.Лево = ос.ШиринаСтраницы + 75;

	КонецЕсли;
		
КонецПроцедуры

Процедура НарисоватьЛинии(ос, строкаДерева, ПараметрыОргсхемы) Экспорт
	
	Если строкаДерева.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Организация") Тогда
		Для каждого стр из строкаДерева.Строки Цикл
			НарисоватьЛинии(ос, стр, ПараметрыОргсхемы);
		КонецЦикла;
		возврат;
	КонецЕсли;
	
	Если ПараметрыОргсхемы.ОформлениеОтдельно Тогда 
		
		Если не (строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Учредитель
			Или строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент 
			Или (строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел и ПараметрыОргсхемы.ЭМ) 
			ИЛИ строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав) Тогда
			Возврат;
		КонецЕсли;
		
	Иначе 
		
		Если не (строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Учредитель
			ИЛИ строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав) Тогда
			Возврат;
		КонецЕсли;
	
	КонецЕсли;
	
			
	серединаЭлемента = строкаДерева.структураЭлемента.Лево + строкаДерева.структураЭлемента.Ширина/2;
	НизЭлемента = строкаДерева.структураЭлемента.Верх + строкаДерева.структураЭлемента.Высота;
		
	Если строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел и ПараметрыОргсхемы.ЭМ Тогда
		
		//линия вниз 
		новЛиния = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
		новЛиния.Лево = серединаЭлемента;
		новЛиния.Верх = НизЭлемента; 
		новЛиния.Ширина = 0;
		новЛиния.Высота = ПараметрыОргсхемы.расстояниеПодОтделом;
	
		возврат;
	КонецЕсли;
	
	КолЧайлдов = строкаДерева.Строки.Количество();
	Если КолЧайлдов = 0 Тогда
		возврат;
	КонецЕсли;

	ПоследнийЧайлд = строкаДерева.Строки[КолЧайлдов-1];
	ПервыйЧайлд = строкаДерева.Строки[0];

	
	//линия вниз (1/2) 
	новЛиния = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
	новЛиния.Лево = серединаЭлемента;
	новЛиния.Верх = НизЭлемента; 
	новЛиния.Ширина = 0;
	новЛиния.Высота = ПараметрыОргсхемы.расстояниеМеждуБлокамиВерт/2;
	
	//горизонтальная вправо
	ШирГорЛин = ПоследнийЧайлд.структураЭлемента.Лево + ПоследнийЧайлд.структураЭлемента.Ширина/2 - серединаЭлемента; 
	Если ШирГорЛин > 0 Тогда
		новЛиния = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
		новЛиния.Лево = серединаЭлемента;
		новЛиния.Верх = НизЭлемента + ПараметрыОргсхемы.расстояниеМеждуБлокамиВерт/2; 
		новЛиния.Ширина = ШирГорЛин;
		новЛиния.Высота = 0;
	КонецЕсли;
	
	//горизонтальная влево
	ШирГорЛин = серединаЭлемента - (ПервыйЧайлд.структураЭлемента.Лево + ПервыйЧайлд.структураЭлемента.Ширина/2); 
	Если ШирГорЛин > 0 Тогда
		новЛиния = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
		новЛиния.Лево = ПервыйЧайлд.структураЭлемента.Лево + ПервыйЧайлд.структураЭлемента.Ширина/2;
		новЛиния.Верх = НизЭлемента + ПараметрыОргсхемы.расстояниеМеждуБлокамиВерт/2; 
		новЛиния.Ширина = ШирГорЛин;
		новЛиния.Высота = 0;
	КонецЕсли;
	
	Для каждого стр из строкаДерева.Строки Цикл
		//вверх от каждого чайлда
		новЛиния = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямая);
		новЛиния.Лево = стр.структураЭлемента.Лево + стр.структураЭлемента.Ширина/2;
		новЛиния.Верх = НизЭлемента + ПараметрыОргсхемы.расстояниеМеждуБлокамиВерт/2; 
		новЛиния.Ширина = 0;
		новЛиния.Высота = стр.структураЭлемента.Верх - новЛиния.Верх;
	
		НарисоватьЛинии(ос, стр, ПараметрыОргсхемы);
	КонецЦикла;
КонецПроцедуры

Процедура НарисоватьЦКП(Организация, ос, ПараметрыОргсхемы, МассивНарисованныхЭлементов, КэшДанных) Экспорт
	ВысотаЦКП_Департамент = ПараметрыОргсхемы.ВысотаЦКП_Департамент;
	ВысотаЦКП_Отдел       = ПараметрыОргсхемы.ВысотаЦКП_Отдел;
	ВысотаЦКП_Орг         = ПараметрыОргсхемы.ВысотаЦКП_Орг;
	
	
	// отделы
	ЛеваяГраница = 1000;
	ПраваяГраница = 0;
	ПараметрыОргсхемы.НижняяТочка = ПараметрыОргсхемы.НижняяТочка + 3;
	
	для каждого стр из МассивНарисованныхЭлементов Цикл
		ЛеваяГраница = Мин(ЛеваяГраница, стр.Лево);
		ПраваяГраница = Макс(ПраваяГраница, стр.Лево + стр.Ширина);
		
		Если стр.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел Тогда
			новБлок = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
			новБлок.Лево = стр.Лево;
			новБлок.Верх = ПараметрыОргсхемы.НижняяТочка; 
			новБлок.Ширина = стр.Ширина;
			новБлок.Высота = ВысотаЦКП_Отдел;
			новБлок.Текст = "ЦКП: " + стр.ЦКП;
			новБлок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			новБлок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			новБлок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			новБлок.Расшифровка = стр.Ссылка;
			// цвет блока
			цв = стр.ЦветФона;
			Если цв<>Неопределено Тогда
				новБлок.ЦветФона = цв;
			КонецЕсли;
			
			шр = стр.Шрифт;
			Если шр<>Неопределено Тогда 
				новБлок.Шрифт = шр;
			Иначе
				новБлок.Шрифт = Новый Шрифт(шр, , , Истина);
			КонецЕсли;
			
			// заливка оставшейся области
			ДопОтступыСекции = стр.КоличествоПодчиненных * ПараметрыОргсхемы.расстояниеМеждуСекциями;  
			новЗаливка = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Прямоугольник);
			новЗаливка.Лево = стр.Лево;
			новЗаливка.Верх = стр.Верх + стр.ВысотаПодчиненных + стр.Высота + ДопОтступыСекции  + ?(ПараметрыОргсхемы.ЭМ,ПараметрыОргсхемы.расстояниеПодОтделом+ПараметрыОргсхемы.ВысотаНО,0); 
			новЗаливка.Ширина = стр.Ширина;
			новЗаливка.Высота = ПараметрыОргсхемы.НижняяТочка - стр.Верх - стр.ВысотаПодчиненных - стр.Высота - ДопОтступыСекции - ?(ПараметрыОргсхемы.ЭМ,ПараметрыОргсхемы.расстояниеПодОтделом+ПараметрыОргсхемы.ВысотаНО,0);
			Если цв<>Неопределено Тогда
				новЗаливка.ЦветФона = цв;
			КонецЕсли;
			новЗаливка.ГраницаСверху = Ложь;		
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОргсхемы.НижняяТочка = ПараметрыОргсхемы.НижняяТочка + ВысотаЦКП_Отдел;
	
	// отделения (департаменты)
	для каждого стр из МассивНарисованныхЭлементов Цикл
		Если стр.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент Тогда
			новБлок = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
			
			Если ПараметрыОргсхемы.ОформлениеОтдельно Тогда //расширяем ЦКП до ширины всех отделов в сумме 
				Лево = 5000000000;
				Ширина = 0;
				Для каждого элем Из МассивНарисованныхЭлементов Цикл
					
					ТекРодит = ИА_ОргСхема_Сервер.КэшДанных_РеквизитПоста(КэшДанных, элем.ссылка, "Родитель");
					Если ТекРодит = стр.Ссылка 
						И элем.ТипТерминала = ПредопределенноеЗначение("Перечисление.ТипТерминалаОргСхемы.Отдел") Тогда
						Ширина = Окр(Ширина + элем.Ширина, 0, 1);
						Лево = Мин(Лево, элем.Лево);
					КонецЕсли;	
					
				КонецЦикла;	
				новБлок.Лево = Лево;
				Если ПараметрыОргсхемы.ЭМ Тогда					
					новБлок.Ширина = Ширина + ПараметрыОргсхемы.расстояниеМеждуОтделами*(стр.КоличествоПодчиненных-1);		
				Иначе
					новБлок.Ширина = Ширина;
				КонецЕсли;
				
			Иначе
				новБлок.Лево = стр.Лево;
				новБлок.Ширина = стр.Ширина;
			КонецЕсли;
			
			новБлок.Верх = ПараметрыОргсхемы.НижняяТочка + ?(ПараметрыОргсхемы.ЭМ,4,0); 
			новБлок.Высота = ВысотаЦКП_Департамент;
			новБлок.Текст = "ЦКП: " + стр.ЦКП;
			новБлок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
			новБлок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
			новБлок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
			новБлок.Расшифровка = стр.Ссылка;
			// цвет блока
			цв = стр.ЦветФона;
			Если цв<>Неопределено Тогда
				новБлок.ЦветФона = цв;
			КонецЕсли;
			
			шр = стр.Шрифт;
			Если шр<>Неопределено Тогда 
				новБлок.Шрифт = шр;
			Иначе
				новБлок.Шрифт = Новый Шрифт(шр, , , Истина);
			КонецЕсли;

		КонецЕсли;
	КонецЦикла;
	
	ПараметрыОргсхемы.НижняяТочка = ПараметрыОргсхемы.НижняяТочка + ВысотаЦКП_Департамент + 4 + ?(ПараметрыОргсхемы.ЭМ,4,0);
	
	// цкп организации
	Если не Организация.ЭтоВложеннаяОргсхема Тогда 
		новБлок = ос.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Текст);
		новБлок.Лево = ЛеваяГраница;
		новБлок.Ширина = ПраваяГраница - ЛеваяГраница;
		новБлок.Верх = ПараметрыОргсхемы.НижняяТочка; 	
		новБлок.Высота = ВысотаЦКП_Орг;
		новБлок.Текст = "ЦКП: " + Организация.ЦКП;
		новБлок.ВертикальноеПоложение = ВертикальноеПоложение.Центр;
		новБлок.ГоризонтальноеПоложение = ГоризонтальноеПоложение.Центр;
		новБлок.РазмещениеТекста = ТипРазмещенияТекстаТабличногоДокумента.Переносить;
		новБлок.Расшифровка = Организация.Ссылка;
		// цвет блока
		цв = Организация.ЦветФона;
		Если цв<>Неопределено Тогда
			новБлок.ЦветФона = цв;
		КонецЕсли;
		
		шр = Организация.Шрифт;
		Если шр<>Неопределено Тогда 
			новБлок.Шрифт = шр;
		Иначе
			новБлок.Шрифт = Новый Шрифт(шр, , , Истина);
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗаполнитьДерево(строкаДерева, П, КэшДанных = Неопределено) Экспорт
			
	ЭтоДепартамент = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент;
	ЭтоРукСостав = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав;
	ЭтоУчредитель = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Учредитель;
	ЭтоОтдел = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел;
	ЭтоСекция = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция;
	ЭтоСектор = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор;
	ЭтоСотрудник = строкаДерева.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сотрудник;
	
	ширинаПодч = 0;
	ВысотаПодч = 0;
    
    Если КэшДанных = Неопределено Тогда
    	КэшДанных = ИА_Защита_Оргсхема.КэшДанных_Сформировать();
    КонецЕсли; 
    ТЗ_Выборка = ИА_ОргСхема_Сервер.КэшДанных_ПостыПоРодителю(КэшДанных, строкаДерева.Ссылка);
    
	КолПодч = 0;
    Для каждого Выборка Из ТЗ_Выборка Цикл
		
		Новстр = ДобавитьСтрокуВДерево(строкаДерева.Строки);
		
		Новстр.Ссылка = Выборка.Ссылка;
		Новстр.ТипТерминала = Выборка.ТипТерминала;

		ТекРодитель = ИА_ОргСхема_Сервер.КэшДанных_РеквизитПоста(КэшДанных, Выборка.Ссылка, "Родитель");
		Новстр.ТипТерминалаРодителя = ИА_ОргСхема_Сервер.КэшДанных_РеквизитПоста(КэшДанных, ТекРодитель, "ТипТерминала");
		Новстр.Ширина = Выборка.Ширина;
		
		Если Новстр.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.РуководящийСостав ТОгда
			Новстр.Высота = П.МаксВысотаРукСостав;
		ИначеЕсли Новстр.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Департамент ТОгда
			Новстр.Высота = П.МаксВысотаДепартаменты;
		ИначеЕсли Новстр.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Отдел ТОгда
			Новстр.Высота = П.МаксВысотаОтделы;
		Иначе
			Новстр.Высота = Выборка.Высота;
		КонецЕсли;

		Новстр.Фотографии = Выборка.Фотографии;
		Новстр.НаименованиеДляОргсхемы = Выборка.НаименованиеДляОргсхемы;
		Новстр.Шрифт = Выборка.Шрифт.Получить();
		Новстр.ЦветФона = Выборка.ЦветФона.Получить();
		Новстр.ПоднятьВверх = Выборка.ПоднятьВверх;
		Новстр.ЦКП = Выборка.ЦКП;
		
		
		ЗаполнитьДерево(Новстр, П, КэшДанных);
		ширинаПодч = ширинаПодч + Новстр.ШиринаПодчиненных; 
		ВысотаПодч = ВысотаПодч + Новстр.Высота + ?(Новстр.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Секция или Новстр.ТипТерминала = Перечисления.ТипТерминалаОргСхемы.Сектор, 0, Новстр.ВысотаПодчиненных); 
		КолПодч = КолПодч + 1;
	КонецЦикла;
    
    строкаДерева.ШиринаПодчиненных = ?(ширинаПодч=0, ИА_ОргСхема_Сервер.КэшДанных_РеквизитПоста(КэшДанных, строкаДерева.Ссылка, "Ширина"), ширинаПодч); 
	
	строкаДерева.ВысотаПодчиненных = ВысотаПодч; 
	
	Если ЭтоРукСостав ТОгда
		строкаДерева.Высота = П.МаксВысотаРукСостав;
	ИначеЕсли ЭтоДепартамент ТОгда
		строкаДерева.Высота = П.МаксВысотаДепартаменты;
	ИначеЕсли ЭтоОтдел ТОгда
		строкаДерева.Высота = П.МаксВысотаОтделы;
    Иначе
        строкаДерева.Высота = ИА_ОргСхема_Сервер.КэшДанных_РеквизитПоста(КэшДанных, строкаДерева.Ссылка, "Высота");
	КонецЕсли;

    строкаДерева.ВысотаЗаголовка = ИА_ОргСхема_Сервер.КэшДанных_РеквизитПоста(КэшДанных, строкаДерева.Ссылка, "ВысотаЗаголовка");
    стрДереваСсылкаШирина = ИА_ОргСхема_Сервер.КэшДанных_РеквизитПоста(КэшДанных, строкаДерева.Ссылка, "Ширина");
	

	Если ЭтоДепартамент Тогда
		Если П.ЭМ И КолПодч > 0 Тогда
			строкаДерева.ШиринаПодчиненных = строкаДерева.ШиринаПодчиненных + П.расстояниеМеждуОтделами*(КолПодч-1);	
		КонецЕсли;
		строкаДерева.Ширина = ?(ширинаПодч=0, стрДереваСсылкаШирина, строкаДерева.ШиринаПодчиненных);		
	ИначеЕсли ЭтоСотрудник Тогда
		строкаДерева.Ширина = стрДереваСсылкаШирина;
		строкаДерева.ШиринаПодчиненных = строкаДерева.Ширина;
	ИначеЕсли ЭтоСекция или ЭтоСектор или ЭтоОтдел Тогда
		строкаДерева.Ширина = стрДереваСсылкаШирина;
		строкаДерева.ШиринаПодчиненных = строкаДерева.Ширина;
	ИначеЕсли ЭтоРукСостав И КолПодч > 0 Тогда
		строкаДерева.ШиринаПодчиненных = строкаДерева.ШиринаПодчиненных + П.расстояниеМеждуБлоками*(КолПодч-1);	
	КонецЕсли;
КонецПроцедуры

Процедура ПостроитьОС(ОрганизацияСсылка, ТабДокОргСхемаХранилище, МассивНарисованныхЭлементовХранилище, РасшифровкиРисунков) Экспорт
	Если ОрганизацияСсылка.ПометкаУдаления Тогда
		Сообщить("Организация помечена на удаление! Выберите другую.");
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(ТабДокОргСхемаХранилище) = Тип("ХранилищеЗначения") Тогда
		ТабДокОргСхема = ТабДокОргСхемаХранилище.Получить();
	Иначе
		ТабДокОргСхема = ТабДокОргСхемаХранилище;
	КонецЕсли;
	
	Если ТипЗнч(МассивНарисованныхЭлементовХранилище) = Тип("ХранилищеЗначения") Тогда
		МассивНарисованныхЭлементов = МассивНарисованныхЭлементовХранилище.Получить();
	Иначе
		МассивНарисованныхЭлементов = МассивНарисованныхЭлементовХранилище;
	КонецЕсли;	
	
	ПараметрыОргсхемы = ИА_Защита_Оргсхема.ПараметрыОргСхемы(ОрганизацияСсылка);
	ПараметрыОргсхемы.НижняяТочка = 0;           
	Дерево = СтруктураСтрокиДерева();
	КэшДанных = ИА_Защита_Оргсхема.КэшДанных_Сформировать();
	
	Начало = ИА_Защита_Оргсхема.ПолучитьПервыйЭлементОргсхемы(ОрганизацияСсылка);	
	Если Начало = Неопределено Тогда
		Сообщить("Не найдена оргсхема!");
		Возврат;
	КонецЕсли;
	Начало.Шрифт = Начало.Шрифт.Получить();
	Начало.ЦветФона = Начало.ЦветФона.Получить();	
    
	// заполнение дерева
	Новстр = ДобавитьСтрокуВДерево(Дерево.Строки);
	ЗаполнитьЗначенияСвойств(Новстр, Начало);
	
	ЗаполнитьДерево(НовСтр, ПараметрыОргсхемы, КэшДанных);
	
	// вычислим уровень департаментов
	дерВрем = Новый ХранилищеЗначения(Дерево);
	ПараметрыОргсхемы.УровеньДепартаментов = ИА_Защита_Оргсхема.НайтиГлубинуДепартаментов(дерВрем, ПараметрыОргсхемы, ОрганизацияСсылка);

	
	// рисование
	МассивНарисованныхЭлементов = Новый Массив;
	НарисоватьДерево(ТабДокОргСхема, Новстр, ПараметрыОргсхемы.пОтступСлева, ПараметрыОргсхемы.пОтступСверху, ПараметрыОргсхемы, МассивНарисованныхЭлементов, КэшДанных);
	
	НарисоватьЛинии(ТабДокОргСхема, НовСтр, ПараметрыОргсхемы);
	НарисоватьЦКП(ИА_ОргСхема_Сервер.Ссылка2Стрктура(ОрганизацияСсылка,"ЦКП, Шрифт, ЦветФона, Ссылка, ЭтоВложеннаяОргсхема"), ТабДокОргСхема, ПараметрыОргсхемы, МассивНарисованныхЭлементов,КэшДанных);
	
	//ТабДокОргСхемаХранилище = Новый ХранилищеЗначения(ТабДокОргСхема);
	//МассивНарисованныхЭлементовХранилище = Новый ХранилищеЗначения(МассивНарисованныхЭлементов);
	
	Если ТипЗнч(ТабДокОргСхемаХранилище) = Тип("ХранилищеЗначения") Тогда
		ТабДокОргСхемаХранилище = Новый ХранилищеЗначения(ТабДокОргСхема);
	Иначе
		ТабДокОргСхемаХранилище = ТабДокОргСхема;
	КонецЕсли;
	
	Если ТипЗнч(МассивНарисованныхЭлементовХранилище) = Тип("ХранилищеЗначения") Тогда
		МассивНарисованныхЭлементовХранилище = Новый ХранилищеЗначения(МассивНарисованныхЭлементов);
	Иначе
		МассивНарисованныхЭлементовХранилище = МассивНарисованныхЭлементов;
	КонецЕсли;

КонецПроцедуры

Функция ДобавитьСтрокуВДерево(Строки) Экспорт
	
	Строки.Добавить(СтруктураСтрокиДерева());
	Возврат Строки[Строки.ВГраница()];
	
КонецФункции

Функция СтруктураСтрокиДерева()
	Д = Новый Структура;
	
	Д.Вставить("Ссылка");
	Д.Вставить("Ширина");
	Д.Вставить("Высота");
	Д.Вставить("ВысотаЗаголовка");
	Д.Вставить("ШиринаПодчиненных");
	Д.Вставить("ВысотаПодчиненных");
	Д.Вставить("СтруктураЭлемента");
	Д.Вставить("ТипТерминала");
	Д.Вставить("ТипТерминалаРодителя");
	Д.Вставить("НаименованиеДляОргсхемы");
	Д.Вставить("Шрифт");
	Д.Вставить("ЦветФона");
	Д.Вставить("Фотографии");
	Д.Вставить("ПоднятьВверх");
	Д.Вставить("ЦКП");
	
	
	Д.Вставить("Строки", Новый Массив);
	
	Возврат Д;
КонецФункции
